; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	infrared5 - mode
	infrared1 - mode
	image2 - mode
	spectrograph0 - mode
	infrared4 - mode
	GroundStation3 - direction
	GroundStation2 - direction
	Star0 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared5)
	(supports instrument2 infrared4)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared4)
	(supports instrument3 image3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 infrared4)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared4)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 GroundStation1)
	(have_image Planet6 image2)
	(have_image Planet6 spectrograph0)
	(have_image Phenomenon7 image3)
	(have_image Star8 image3)
	(have_image Star8 image2)
	(have_image Star9 infrared5)
	(have_image Star9 infrared4)
	(have_image Phenomenon10 infrared5)
))

)

; plan
1. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 star8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star8)
   goals met: 0 of 10
5. (take_image satellite1 star8 instrument3 image3)
   added: (have_image star8 image3)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon7 instrument3 image3)
   added: (have_image phenomenon7 image3)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation1 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
10. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 10
11. (turn_to satellite0 phenomenon10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
12. (take_image satellite0 phenomenon10 instrument0 infrared5)
   added: (have_image phenomenon10 infrared5)
   goals met: 4 of 10
13. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   goals met: 4 of 10
14. (take_image satellite0 planet6 instrument0 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 5 of 10
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 10
16. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 10
17. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 10
18. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 5 of 10
19. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   goals met: 5 of 10
20. (take_image satellite0 planet6 instrument2 image2)
   added: (have_image planet6 image2)
   goals met: 6 of 10
21. (turn_to satellite0 star9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star9)
   goals met: 6 of 10
22. (take_image satellite0 star9 instrument2 infrared4)
   added: (have_image star9 infrared4)
   goals met: 7 of 10
23. (take_image satellite0 star9 instrument2 infrared5)
   added: (have_image star9 infrared5)
   goals met: 8 of 10
24. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 9 of 10
25. (take_image satellite0 star8 instrument2 image2)
   added: (have_image star8 image2)
   goals met: 10 of 10
